app/controllers/books_controller.rb

  def index
    @books = Book.order("title")
---
SELECT "books".* FROM "books" ORDER BY title