app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY id
---
  def index
    @books = Book.order("id")

INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create


    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author" = $2, "price" = $3, "published_date" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "Second Book"], ["author", "1"], ["price", 18.0], ["published_date", "2021-01-29 00:00:00"], ["updated_at", "2021-01-29 06:06:12.658441"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    name = @book.title
    flash[:notice] = 'Successfully Edited Book: '+name + "!"
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 21]]
---
  def destroy
    @book = Book.find(params[:id])
    name = @book.title
    @book.destroy